import 'package:flutter/material.dart';

const Color primaryColor = Color(0xFFF67952);
const Color bgColor = Color(0xFFFBFBFD);

const double defaultPadding = 16.0;
const double defaultBorderRadius = 12.0;

const String jimbeam = '미국의 대표적인 버번 위스키 브랜드. '
    '1795년까지 7대를 거슬러 올라가는 유구한 역사를 지닌 아메리칸 위스키이다.'
    '미국의 버번 위스키로서 대중적으로 유명하고 역사적인 명성이 있다. '
    '그 때문에 미국에서는 우리나라에서의 소주와 비슷한 위치의 술이다. '
    '한국에서는 주로 하이볼이나 짐빔 코크라는 칵테일 형태로 소비되고, '
    '미국에서도 음료수에 타서 마시는 것이 보통이다'
    ;

const String oldFashionedtext = '위스키 베이스 칵테일로, 칵테일의 원형이라 할 수 있는 외형을 지녔다고 표현된다. '
    '명칭이 칵테일의 역사에서 유래한 것인데, 본래 올드 패션드는 양주, 설탕, 그리고 비터스 이 세 가지 재료를 쓴 단순한 조합의 음료였으며, 당시에는 비터드 슬링(Bittered Sling)이라 불렀다. '
    '이후 19세기 미국에서 여러 바텐더들이 버번 위스키를 통해 이전의 단순한 맛에서 다양한 맛으로 바꾸기 위해 여러 번의 시도를 진행하게 된다.'
    '그러나 이전의 심플한 조합의 칵테일은 수요는 여전했고, 때문에 이전의 레시피에 버번 위스키만 추가된 버번 위스키, 앙고스투라 비터,'
    ' 설탕 혹은 시럽을 써서 만드는 칵테일을 ”옛날 방식” 이라는 의미의 ”Old Fashioned” 라는 이름으로 부르게 되었다고 한다. '
    '이러한 사연에 따라 이 올드 패션드와는 상반되어 위의 건너온 재료가 들어가는 “개량된 위스키 칵테일(Improved Whiskey Cocktail)” 이라는 레시피도 있다. '
    '이러한 역사와 심플함으로 인해 바리에이션이 아주 다양하고, 바의 특색을 관찰할 수 있는 음료이다.'
;

const String longteatext = '데킬라, 럼, 보드카 등 여러 양주를 베이스로 하는 칵테일이며, 한국의 바에서는 줄여서 롱티라고 흔히 부른다.'
    '레몬맛이 강한 아이스 티와 어느 정도 비슷하고, 콜라의 단맛이 알콜 맛을 어느 정도 감춰주어 마시기 쉽기 때문에 인기 있는 칵테일 중 하나다. '
    '그러나 실제로 도수를 계산해 보면 대략 10-20도 전후. 양이 많기 때문에 많게는 30도 정도로 나오기도 한다.'
    '미국의 금주법 시대에 밀주된 술을 팔거나 마셔놓고 소량으로 남겨둘 수 없기 때문에 남는 술을 종류불문 일단 다 넣어서 '
    '한번에 마실 생각으로 만들어진 잡탕술이 칵테일 레시피로 정립된 것이라는 썰이 있다.';